<template>
	<div>
		<v-container>
			<h1 class="text-h2">
				Технічні аспекти реалізації фірмового стилю на веб-сайті
			</h1>
			<div class="mt-10">
				<h3 class="text-h5">HTML (HyperText Markup Language)</h3>
				<v-card class="pa-4 mt-5">
					<v-card-text class="text-h6">
						<blockquote class="blockquote">
							<footer class="blockquote-footer">
								HTML є мовою розмітки, яка використовується для створення
								структури та відображення вмісту веб-сторінок. Основна функція
								HTML полягає в тому, щоб визначати різні елементи на
								веб-сторінці та їх взаємозв'язки. HTML використовується для
								створення заголовків, параграфів, списків, таблиць, посилань,
								форм і багатьох інших елементів. Використовуючи теги та їх
								атрибути, розробники можуть створювати структуру сторінок та
								визначати їх вміст.
							</footer>
						</blockquote>
					</v-card-text>
				</v-card>

				<explanation-panel class="mt-5" :data="htmlExplanation" />
			</div>

			<v-divider class="ma-10"></v-divider>

			<div class="mt-10">
				<h3 class="text-h5">CSS (Cascading Style Sheets)</h3>
				<v-card class="pa-4 mt-5">
					<v-card-text class="text-h6">
						<blockquote class="blockquote">
							<footer class="blockquote-footer">
								CSS є мовою стилів, яка використовується для визначення вигляду
								та форматування веб-сторінок, написаних мовою HTML. Основна
								функція CSS полягає в тому, щоб визначати стилізацію, колір,
								розміри, відступи, шрифти та інші візуальні аспекти елементів
								HTML на веб-сторінці. CSS використовується для створення
								привабливого та естетичного вигляду веб-сайтів, а також для
								забезпечення їх консистентності та доступності на різних
								пристроях та екранах.
							</footer>
						</blockquote>
					</v-card-text>
				</v-card>

				<explanation-panel class="mt-5" :data="cssExplanation" />

				<p class="mt-10">
					Узагальнено кажучи, HTML визначає структуру та контент веб-сторінки,
					тоді як CSS визначає її вигляд та оформлення. Вони часто
					використовуються разом для створення привабливих та добре
					організованих веб-сторінок.
				</p>
			</div>
		</v-container>
	</div>
</template>

<script>
import ExplanationPanel from '@/components/ExplanationPanel.vue'

export default {
	components: {
		ExplanationPanel,
	},
	computed: {
		htmlExplanation() {
			return [
				{
					title: 'Використання фірмових кольорів',
					text: 'Визначення основних та додаткових кольорів бренду та їх використання для фонів, тексту, кнопок, та інших елементів.',
				},
				{
					title: 'Шрифти',
					text: 'Використання основних та додаткових шрифтів бренду для текстових елементів. Це може бути досягнуто через вбудову шрифтів або зовнішні файли шрифтів (наприклад, Google Fonts).',
				},
				{
					title: 'Графічні елементи',
					text: 'Додавання графічних елементів, таких як логотипи, іконки, лінії, та фонові зображення, які відповідають фірмовому стилю.',
				},
			]
		},
		cssExplanation() {
			return [
				{
					title: 'Використання фірмових кольорів',
					text: 'Визначення основних та додаткових кольорів бренду та їх використання для фонів, тексту, кнопок, та інших елементів.',
				},
				{
					title: 'Шрифти',
					text: 'Використання основних та додаткових шрифтів бренду для текстових елементів. Це може бути досягнуто через вбудову шрифтів або зовнішні файли шрифтів (наприклад, Google Fonts).',
				},
				{
					title: 'Графічні елементи',
					text: 'Додавання графічних елементів, таких як логотипи, іконки, лінії, та фонові зображення, які відповідають фірмовому стилю.',
				},
			]
		},
	},
}
</script>

<style lang="scss" scoped></style>
