<template>
	<div class="intro">
		<v-container>
			<h1 class="text-h2 mt-10">Вступ до проектування фірмового стилю</h1>
			<div class="mt-10">
				<h3 class="text-h5">Опис поняття фірмового стилю</h3>
				<v-card class="pa-4 mt-5">
					<v-card-text class="text-h6">
						<blockquote class="blockquote">
							<footer class="blockquote-footer">
								Фірмовий стиль, також відомий як брендбук або стиль бренду, є
								набором визначених елементів дизайну та ідентичності, що
								представляють бренд або компанію. Це включає в себе такі
								складові як логотип, кольорову палітру, типографію, графічні
								елементи та стиль письма. Фірмовий стиль створює унікальний та
								легко впізнаваний образ, який допомагає відокремити бренд від
								конкурентів та підсилити ідентичність компанії серед аудиторії.
							</footer>
						</blockquote>
					</v-card-text>
				</v-card>

				<explanation-panel class="mt-5" :data="styleExplanations" />
			</div>

			<div class="mt-10">
				<h3 class="text-h5">Значення фірмового стилю для веб-сайту</h3>
				<v-card class="pa-4 mt-5">
					<v-card-text class="text-h6">
						<blockquote class="blockquote">
							<footer class="blockquote-footer">
								Фірмовий стиль відіграє важливу роль у створенні успішного
								веб-сайту. Він надає єдність та стабільність у дизайні, що
								допомагає створити позитивне перше враження у відвідувачів.
								Завдяки фірмовому стилю, веб-сайт стає легко впізнаваним для
								користувачів, що змушує їх відчувати стабільність та довіру до
								бренду. Крім того, правильно реалізований фірмовий стиль сприяє
								підвищенню конверсії, збільшенню лояльності клієнтів та
								зміцненню позиції бренду на ринку.
							</footer>
						</blockquote>
					</v-card-text>
				</v-card>
				<p class="mt-5">
					Одним із основних переваг фірмового стилю для веб-сайту є створення
					єдності та консистентності в дизайні. Консистентність у використанні
					кольорів, шрифтів та графічних елементів допомагає користувачам з
					легкістю орієнтуватися на сайті, підвищує їхню довіру до бренду та
					сприяє збільшенню конверсії.
				</p>
				<p>
					Бездоганний фірмовий стиль також створює позитивне перше враження у
					відвідувачів. Легка впізнаваність та професійний вигляд сайту
					забезпечуються завдяки ретельному використанню всіх елементів
					фірмового стилю.
				</p>
				<p>
					Крім того, використання фірмового стилю на веб-сайті допомагає
					зміцнити стикаються з послідовним та професійним дизайном на всіх
					сторінках імідж бренду та підвищити лояльність клієнтів. Користувачі,
					які сайту, частіше повертаються та взаємодіють з брендом. Таким чином,
					фірмовий стиль є важливою складовою успішного веб-сайту, що допомагає
					не лише залучати нових користувачів, а й утримувати їх та підвищувати
					їхню лояльність до бренду.
				</p>
			</div>
		</v-container>
	</div>
</template>

<script>
import ExplanationPanel from '@/components/ExplanationPanel.vue'

export default {
	components: {
		ExplanationPanel,
	},
	computed: {
		styleExplanations() {
			return [
				{
					title: 'Історія бренду',
					text: 'Опис того, як бренд виник і як його фірмовий стиль розвивався протягом часу.',
				},
				{
					title: 'Цілі та цінності бренду',
					text: 'Пояснення того, які цілі та цінності лежать в основі фірмового стилю і як вони відображаються у дизайні та ідентичності бренду.',
				},
				{
					title: 'Цільова аудиторія',
					text: 'Визначення цільової аудиторії бренду і пояснення того, як фірмовий стиль спрямований на задоволення її потреб та вподобань.',
				},
				{
					title: 'Унікальність бренду',
					text: 'Виділення того, що робить бренд унікальним у своєму сегменті ринку та як його фірмовий стиль допомагає підкреслити цю унікальність.',
				},
				{
					title: 'Приклади застосування фірмового стилю',
					text: 'Показ візуальних прикладів, де і як застосовується фірмовий стиль бренду, щоб краще розібратися з його елементами та впливом на враження від бренду.',
				},
			]
		},
	},
}
</script>
