<template>
	<div>
		<v-container>
			<h1 class="text-h2">Поради щодо підтримки фірмового стилю</h1>
			<explanation-panel class="mt-10" :data="tips" />
			<v-sparkline
				class="mt-10"
				:value="value"
				:gradient="gradient"
				:smooth="radius || false"
				:padding="padding"
				:line-width="width"
				:stroke-linecap="lineCap"
				:gradient-direction="gradientDirection"
				:fill="fill"
				:type="type"
				:auto-line-width="autoLineWidth"
				auto-draw
			></v-sparkline>
		</v-container>
	</div>
</template>

<script>
import ExplanationPanel from '@/components/ExplanationPanel.vue'

const gradients = [
	['#222'],
	['#42b3f4'],
	['red', 'orange', 'yellow'],
	['purple', 'violet'],
	['#00c6ff', '#F0F', '#FF0'],
	['#f72047', '#ffd200', '#1feaea'],
]

export default {
	data: () => ({
		width: 2,
		radius: 10,
		padding: 8,
		lineCap: 'round',
		gradient: gradients[5],
		value: [0, 2, 5, 9, 5, 10, 3, 5, 0, 0, 1, 8, 2, 9, 0],
		gradientDirection: 'top',
		gradients,
		fill: false,
		type: 'trend',
		autoLineWidth: false,
	}),
	computed: {
		tips() {
			return [
				{
					title: 'Документація фірмового стилю',
					text: 'Розробіть документ, який описує всі елементи фірмового стилю, такі як кольори, шрифти, типографіка, графічні елементи тощо. Це допоможе всім учасникам розробки відділити вимоги щодо фірмового стилю від інших аспектів проекту.',
				},
				{
					title: 'Використання компонентів',
					text: 'Розробіть бібліотеку компонентів або інтерфейсний фреймворк, які відповідають фірмовому стилю вашого бренду. Використовуйте ці компоненти під час створення нових сторінок, щоб забезпечити консистентність дизайну.',
				},
				{
					title: 'Система керування ресурсами',
					text: 'Використовуйте систему керування ресурсами, таку як CSS-препроцесори або темні стилі від фреймворків, для забезпечення легкості зміни фірмового стилю. Це дозволить легко оновлювати кольори, шрифти та інші елементи стилю за потреби.',
				},
				{
					title: 'Тестування і валідація',
					text: 'Перевіряйте новий контент і зміни веб-сайту на відповідність фірмовому стилю перед їх розгортанням на продуктивний сервер. Використовуйте автоматизовані інструменти для виявлення відхилень від стандартів стилю.',
				},
				{
					title: 'Навчання та підтримка',
					text: 'Надайте навчання та підтримку для розробників, дизайнерів та інших учасників команди щодо правильного використання фірмового стилю. Це може включати документацію, тренінги або доступ до експертів з дизайну.',
				},
				{
					title: 'Моніторинг та оновлення',
					text: 'Регулярно переглядайте та оновлюйте фірмовий стиль відповідно до змін у бренді, ринку та технологічних трендів. Підтримка актуального фірмового стилю допоможе вашому веб-сайту залишатися сучасним та конкурентоспроможним.',
				},
			]
		},
	},
	components: {
		ExplanationPanel,
	},
}
</script>

<style lang="scss" scoped></style>
