<template>
	<div>
		<v-container>
			<h1 class="text-h2">Рекомендації щодо дизайну веб-сайту</h1>
			<p class="mt-10">
				Тут Ви знайдете поради щодо використання кольорів, шрифтів, графічних
				елементів та інших характеристик фірмового стилю для того, щоб ваш
				веб-сайт відповідав цінностям та ідентичності вашого бренду. Долучайтесь
				та отримуйте корисні поради для успішного оформлення вашого сайту!
			</p>
			<explanation-panel class="mt-5" :data="recommendations" />
			<v-snackbar v-model="snackbar" :vertical="vertical">
				{{ text }}
				<template v-slot:action="{ attrs }">
					<v-btn color="primary" text v-bind="attrs" @click="snackbar = false">
						Close
					</v-btn>
				</template>
			</v-snackbar>
		</v-container>
	</div>
</template>

<script>
import ExplanationPanel from '@/components/ExplanationPanel.vue'

export default {
	data: () => ({
		snackbar: false,
		text: 'На цій сторінці ви знайдете поради як зробити Ваш дизайн краще',
		vertical: true,
	}),
	components: {
		ExplanationPanel,
	},
	mounted() {
		setTimeout(() => {
			this.snackbar = true
		}, 1000)
	},
	computed: {
		recommendations() {
			return [
				{
					title: 'Підтримка ідентичності бренду',
					text: 'Впевніться, що дизайн вашого веб-сайту відповідає фірмовому стилю вашого бренду. Використовуйте ті самі кольори, шрифти, графічні елементи та інші естетичні характеристики, які використовуються в інших матеріалах бренду.',
				},
				{
					title: 'Збереження консистентності',
					text: 'Забезпечте консистентність у всьому дизайні веб-сайту. Це означає використання однакових стилів для заголовків, тексту, кнопок, форм та інших елементів, щоб створити однорідний вигляд.',
				},
				{
					title: 'Кольорова палітра',
					text: 'Використовуйте основні та додаткові кольори з фірмової кольорової палітри бренду. Вибір кольорів повинен відображати ідентичність та атмосферу бренду, а також враховувати психологічний вплив кольорів на аудиторію.',
				},
				{
					title: 'Шрифти',
					text: 'Використовуйте основний та додаткові шрифти з фірмового стилю бренду для тексту на веб-сайті. Вибір шрифтів повинен бути чітким, легким для читання та відповідати стилю бренду.',
				},
				{
					title: 'Макет і композиція',
					text: 'Розгляньте використання макету та композиції, які відповідають стилю вашого бренду та забезпечують зручну навігацію та взаємодію з веб-сайтом.',
				},
				{
					title: 'Графічні елементи',
					text: 'Додайте графічні елементи, такі як лінії, форми, іконки тощо, які відповідають фірмовому стилю бренду. Ці елементи можуть допомогти підкреслити унікальність та ідентичність бренду на веб-сайті.',
				},
				{
					title: 'Адаптивність і відповідність',
					text: 'Впевніться, що ваш веб-сайт адаптивний та відповідає всім сучасним стандартам дизайну та веб-розробки. Забезпечення відповідності може підвищити зручність користування та задоволення аудиторії.',
				},
			]
		},
	},
}
</script>

<style lang="scss" scoped></style>
